Revit 2027 API
SolidglassBumpEnableType Enumeration
 The enumerated type representing the permitted values for the asset property "SolidglassBumpEnable" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SolidglassBumpEnableType
Public Enumeration SolidglassBumpEnableType
public enum class SolidglassBumpEnableType
type SolidglassBumpEnableType
Members
Member name | Value | Description
Custom | 3
None | 0
Rippled | 1
Wavy | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace